/* Функция вернет название направления (тип string) по переданному ей коду направления (тип number) */

export function getDirectionByCode(code) {

    if (!Number.isFinite(code)) {                     // если передано не число
        code = +code;                         // приведем его к числу
    }

    if (Number.isNaN(code)) {                         // если передано (или после первого приведения к числу) NaN
        console.error("в функцию определяющую направление по коду направления передано не число");   // сообщение об ошибке
        return "";
    }

    const directions = [
        { code: 10407, name: "Отрожка - Ростов" },
        { code: 10408, name: "Журавка - Боченково" },
        { code: 10452, name: "Предугольная-Краснодонецк" },
        { code: 10453, name: "Зверево -Новомихайловская" },
        { code: 10454, name: "Лесостепь -Юбилейная" },
        { code: 10455, name: "Лесостепь -Усть - Донецкая" },
        { code: 10457, name: "Шахтная -Каменоломни" },
        { code: 10458, name: "Хотунок -Новочеркасска" },
        { code: 10459, name: "Кизитеринка -Батайск" },
        { code: 10460, name: "Развилка -Проточный" },
        { code: 10461, name: "7 подход ст. Лихая" },
        { code: 10462, name: "6 грузовой подход Батайск" },
        { code: 10463, name: "подход Предуг.-Новомихайл" },
        { code: 10467, name: "3 главный ст. Лихая" },
        { code: 10468, name: "Вых. парка ВСев на Ростов" },
        { code: 12801, name: "Урбах-Астрахань" },
        { code: 12802, name: "Червленная Узл.-Астрахань" },
        { code: 12901, name: "Грязи-Волгоград" },
        { code: 12938, name: "Пост 1067 км - Пост 6 км" },
        { code: 13002, name: "Горная -Несветай" },
        { code: 13036, name: "Несветай -Новошахтинск" },
        { code: 13101, name: "Лозовая -Ростов" },
        { code: 13105, name: "Хапры -Батайск" },
        { code: 13135, name: "Марцево -Таганрог - 2" },
        { code: 13136, name: "Таганрог -1 - Таганрог - 2" },
        { code: 13137, name: "Первомайская -Ростов" },
        { code: 13138, name: "Темерник - Зоологич Сад" },
        { code: 13157, name: "обход ст.Хапры" },
        { code: 13180, name: "Гниловская -КрасныйСад" },
        { code: 13201, name: "Батайск -Кривенковская" },
        { code: 13230, name: "Староминск1 -Староминск2" },
        { code: 13231, name: "Тимашевская -Ахтари" },
        { code: 13232, name: "Энемский обход" },
        { code: 13233, name: "Староминская петля" },
        { code: 13234, name: "Выход с Кр.Сада на Старом" },
        { code: 13235, name: "Староминские груз.подходы" },
        { code: 13301, name: "Армавир -Туапсе" },
        { code: 13302, name: "Туапсе -Веселое" },
        { code: 13303, name: "Веселое -Сухуми" },
        { code: 13330, name: "Курганная -Шедок" },
        { code: 13331, name: "Белореченская -Хаджох" },
        { code: 13332, name: "Комсомольская -Апшеронская" },
        { code: 13333, name: "Адлер-Роза Хутор" },
        { code: 13334, name: "Имерет.Курорт -Разъезд5км" },
        { code: 14101, name: "Ростов -Армавир" },
        { code: 14102, name: "Армавир -Мин.Воды" },
        { code: 14103, name: "Мин.Воды -Гудермес" },
        { code: 14104, name: "Прохладная -Гудермес" },
        { code: 14105, name: "Гудермес -Самур" },
        { code: 14136, name: "Сальские груз.подходы" },
        { code: 14137, name: "Тихорецкие груз.подходы" },
        { code: 14138, name: "14 обводной путь МинВоды" },
        { code: 14139, name: "Батайск -Азов" },
        { code: 14140, name: "Батайск -Сальск" },
        { code: 14141, name: "Сосыка -Ейск" },
        { code: 14142, name: "Краснод.обход Тихорецкая" },
        { code: 14143, name: "Сальский обход Тихорецкая" },
        { code: 14144, name: "Армавир I-Армавир II" },
        { code: 14145, name: "Зеленчук -Джегута" },
        { code: 14146, name: "Мин.Воды -Кисловодск" },
        { code: 14147, name: "Бештау -Железноводск" },
        { code: 14149, name: "Котляревская -Нальчик" },
        { code: 14150, name: "Дарг -Кох - Алагир" },
        { code: 14151, name: "Беслан -Владикавказ" },
        { code: 14153, name: "Гудермес - Разъезд 2 км" },
        { code: 14154, name: "Джалка -Гудермес" },
        { code: 14155, name: "Шамхал -Буйнакск" },
        { code: 14157, name: "Батайский обход" },
        { code: 14158, name: "Кизляр -Кизил - Юрт" },
        { code: 19201, name: "Дебальцево -Заповедная" },
        { code: 19202, name: "Заповедная -Замчалово" },
        { code: 19301, name: "Дебальцево -Миллерово" },
        { code: 19402, name: "Лихая -Волгоград" },
        { code: 19430, name: "6 подход ст. Лихая" },
        { code: 19440, name: "Морозовская -Куберле" },
        { code: 21101, name: "Разгуляевка -Н.Баскунчак" },
        { code: 21201, name: "Волгоград -Краснодар" },
        { code: 21202, name: "Энем -Новороссийск" },
        { code: 21203, name: "Козырьки -Гречаная" },
        { code: 21133, name: "Солончак-В.Баскунчак" },
        { code: 21233, name: "Песчанокопская -Передовая" },
        { code: 21237, name: "Крымская -Грушевая" },
        { code: 21238, name: "Новороссийская петля" },
        { code: 21302, name: "Разъезд 9 км - Кавказ" },
        { code: 21330, name: "Крымская -Тимашевская" },
        { code: 21331, name: "Юровский -Анапа" },
        { code: 21333, name: "Красная Стрела - Темрюк" },
        { code: 21334, name: "Подход 1 ст. Разъезд 9 км" },
        { code: 21335, name: "Подход 2 ст. Разъезд 9 км" },
        { code: 21401, name: "Кавказская -Элиста" },
        { code: 21402, name: "Кавказская -Краснодар" },
        { code: 21430, name: "Палагиада -Ставрополь" },
        { code: 21431, name: "Светлоград -Георгиевск" },
        { code: 21432, name: "Краснодар -Витаминный" },
        { code: 21433, name: "Краснодар -Пашковская" },
        { code: 21434, name: "Краснодар -Лорис" },
        { code: 21435, name: "Буденновск1 -Буденновск2" },
        { code: 21436, name: "Обвод. путь ст .Буденновск" },
        { code: 21437, name: "Обвод.путь ст.Пашковская" },
        { code: 55001, name: "На Железный Рог" },
        { code: 55002, name: "Вышестеблиевская -Керчь" },
    ];

    const targetDirection = directions.find(item => item.code === code);
    debugger
    if (typeof targetDirection === "undefined") {               // если не нашел переданного направления
        console.error("Внимание!!!!! Код направления в функции не найден, перепроверьте функцию getDirectionByCode!!!!! Переданный код направления: " + code);
        return "";
    } else {                                    // если нашел
        return targetDirection.name;
    }







    // switch (code) {
    //     case 10407: return "Отрожка - Ростов";
    //     case 10408: return "Журавка - Боченково";
    //     case 10452: return "Предугольная-Краснодонецк";
    //     case 10453: return "Зверево -Новомихайловская";
    //     case 10454: return "Лесостепь -Юбилейная";
    //     case 10455: return "Лесостепь -Усть - Донецкая";
    //     case 10457: return "Шахтная -Каменоломни";
    //     case 10458: return "Хотунок -Новочеркасска";
    //     case 10459: return "Кизитеринка -Батайск";
    //     case 10460: return "Развилка -Проточный";
    //     case 10461: return "7 подход ст. Лихая";
    //     case 10462: return "6 грузовой подход Батайск";
    //     case 10463: return "подход Предуг.-Новомихайл";
    //     case 10467: return "3 главный ст. Лихая";
    //     case 10468: return "Вых. парка ВСев на Ростов";
    //     case 12801: return "Урбах-Астрахань";
    //     case 12802: return "Червленная Узл.-Астрахань";
    //     case 12901: return "Грязи-Волгоград";
    //     case 12938: return "Пост 1067 км - Пост 6 км";
    //     case 13002: return "Горная -Несветай";
    //     case 13036: return "Несветай -Новошахтинск";
    //     case 13101: return "Лозовая -Ростов";
    //     case 13105: return "Хапры -Батайск";
    //     case 13135: return "Марцево -Таганрог - 2";
    //     case 13136: return "Таганрог -1 - Таганрог - 2";
    //     case 13137: return "Первомайская -Ростов";
    //     case 13138: return "Темерник - Зоологич Сад";
    //     case 13157: return "обход ст.Хапры";
    //     case 13180: return "Гниловская -КрасныйСад";
    //     case 13201: return "Батайск -Кривенковская";
    //     case 13230: return "Староминск1 -Староминск2";
    //     case 13231: return "Тимашевская -Ахтари";
    //     case 13232: return "Энемский обход";
    //     case 13233: return "Староминская петля";
    //     case 13234: return "Выход с Кр.Сада на Старом";
    //     case 13235: return "Староминские груз.подходы";
    //     case 13301: return "Армавир -Туапсе";
    //     case 13302: return "Туапсе -Веселое";
    //     case 13303: return "Веселое -Сухуми";
    //     case 13330: return "Курганная -Шедок";
    //     case 13331: return "Белореченская -Хаджох";
    //     case 13332: return "Комсомольская -Апшеронская";
    //     case 13333: return "Адлер-Роза Хутор";
    //     case 13334: return "Имерет.Курорт -Разъезд5км";
    //     case 14101: return "Ростов -Армавир";
    //     case 14102: return "Армавир -Мин.Воды";
    //     case 14103: return "Мин.Воды -Гудермес";
    //     case 14104: return "Прохладная -Гудермес";
    //     case 14105: return "Гудермес -Самур";
    //     case 14136: return "Сальские груз.подходы";
    //     case 14137: return "Тихорецкие груз.подходы";
    //     case 14138: return "14 обводной путь МинВоды";
    //     case 14139: return "Батайск -Азов";
    //     case 14140: return "Батайск -Сальск";
    //     case 14141: return "Сосыка -Ейск";
    //     case 14142: return "Краснод.обход Тихорецкая";
    //     case 14143: return "Сальский обход Тихорецкая";
    //     case 14144: return "Армавир I-Армавир II";
    //     case 14145: return "Зеленчук -Джегута";
    //     case 14146: return "Мин.Воды -Кисловодск";
    //     case 14147: return "Бештау -Железноводск";
    //     case 14149: return "Котляревская -Нальчик";
    //     case 14150: return "Дарг -Кох - Алагир";
    //     case 14151: return "Беслан -Владикавказ";
    //     case 14153: return "Гудермес - Разъезд 2 км";
    //     case 14154: return "Джалка -Гудермес";
    //     case 14155: return "Шамхал -Буйнакск";
    //     case 14157: return "Батайский обход";
    //     case 14158: return "Кизляр -Кизил - Юрт";
    //     case 19201: return "Дебальцево -Заповедная";
    //     case 19202: return "Заповедная -Замчалово";
    //     case 19301: return "Дебальцево -Миллерово";
    //     case 19402: return "Лихая -Волгоград";
    //     case 19430: return "6 подход ст. Лихая";
    //     case 19440: return "Морозовская -Куберле";
    //     case 21101: return "Разгуляевка -Н.Баскунчак";
    //     case 21201: return "Волгоград -Краснодар";
    //     case 21202: return "Энем -Новороссийск";
    //     case 21203: return "Козырьки -Гречаная";
    //     case 21133: return "Солончак-В.Баскунчак";
    //     case 21233: return "Песчанокопская -Передовая";
    //     case 21237: return "Крымская -Грушевая";
    //     case 21238: return "Новороссийская петля";
    //     case 21302: return "Разъезд 9 км - Кавказ";
    //     case 21330: return "Крымская -Тимашевская";
    //     case 21331: return "Юровский -Анапа";
    //     case 21333: return "Красная Стрела - Темрюк";
    //     case 21334: return "Подход 1 ст. Разъезд 9 км";
    //     case 21335: return "Подход 2 ст. Разъезд 9 км";
    //     case 21401: return "Кавказская -Элиста";
    //     case 21402: return "Кавказская -Краснодар";
    //     case 21430: return "Палагиада -Ставрополь";
    //     case 21431: return "Светлоград -Георгиевск";
    //     case 21432: return "Краснодар -Витаминный";
    //     case 21433: return "Краснодар -Пашковская";
    //     case 21434: return "Краснодар -Лорис";
    //     case 21435: return "Буденновск1 -Буденновск2";
    //     case 21436: return "Обвод. путь ст .Буденновск";
    //     case 21437: return "Обвод.путь ст.Пашковская";
    //     case 55001: return "На Железный Рог";
    //     case 55002: return "Вышестеблиевская -Керчь";
    //     default: {
    //         console.error("Внимание!!!!! Код направления в функции не найден, перепроверьте функцию getDirectionByCode!!!!! Переданный код направления: " + code);
    //         return "";
    //     }
    // }
}